bench/results/scaling-nodelay-20260427-040923/trillium-mop-c16.h2load.txt
starting benchmark...
spawning thread #0: 4 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #1: 4 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #2: 4 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #3: 4 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
Warm-up started for thread #3.
Warm-up started for thread #0.
Warm-up started for thread #1.
progress: 25% of clients started
progress: 50% of clients started
progress: 75% of clients started
progress: 100% of clients started
Warm-up started for thread #2.
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #Warm-up phase is over for thread #3.2
.Main benchmark duration is started for thread #3.

Main benchmark duration is started for thread #2.
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3

finished in 9.00s, 405181.25 req/s, 35.94MB/s
requests: 3241450 total, 3241450 started, 3241450 done, 3241450 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 3241450 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 287.49MB (301454850) total, 222.45MB (233255296) headers (space savings 40.74%), 6.95MB (7289228) data
                     min         max         mean         sd        +/- sd
time for request:       25us     34.28ms      3.84ms      4.12ms    80.94%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :   24318.64    26228.19    25322.47      579.80    62.50%