bench/results/scaling-nodelay-20260427-040923/trillium-mop-c4.h2load.txt
starting benchmark...
spawning thread #0: 1 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #1: 1 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #2: 1 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #3: 1 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
Warm-up started for thread #3.
Warm-up started for thread #1.
Warm-up started for thread #0.
Warm-up started for thread #2.
progress: 100% of clients started
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3

finished in 9.00s, 429318.75 req/s, 38.08MB/s
requests: 3434550 total, 3434550 started, 3434550 done, 3434550 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 3434550 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 304.62MB (319413150) total, 235.73MB (247184576) headers (space savings 40.74%), 7.37MB (7724518) data
                     min         max         mean         sd        +/- sd
time for request:       28us      4.43ms       853us       291us    70.56%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :  107069.92   107564.99   107325.93      206.39    50.00%